pages/wiki/C.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C/C++ | 赵骥's Site</title>
<link href="../../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/theme.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://qiwulun.github.io/pages/wiki/C.html">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css">
<link href="../../mycss/tweak.css" rel="stylesheet" type="text/css">
<base target="_parent">
<meta name="author" content="Zhao JI">
<meta property="og:site_name" content="赵骥's Site">
<meta property="og:title" content="C/C++">
<meta property="og:url" content="https://qiwulun.github.io/pages/wiki/C.html">
<meta property="og:description" content="Table of Contents


语法

header
变量

存储持续性、作用域与链接性：




IDE

CLion






语法


header


#include 如果用“”来包含文件名，则编译器先在当前的工作目录或源代码目录，用&lt;&gt;则先在存储标准头文件的文件夹中找，




变量


存储持续性、作用域与链接性：


1、自动存储持续性：函数或代码块中的变量（包括函数参数">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-02-14T14:35:58+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://qiwulun.github.io/">

                <span id="blog-title">赵骥's Site</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">文章存档</a>
                </li>
<li>
<a href="../../galleries/">图库</a>
                </li>
<li>
<a href="../../categories/">标签</a>
                </li>
<li>
<a href="../../rss.xml">RSS 源</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">C/C++</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">
                    Zhao JI
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-02-14T14:35:58+08:00" itemprop="datePublished" title="2017-02-14 14:35">2017-02-14 14:35</time></a></p>
                <p class="commentline">
        
    <a href="C.html#disqus_thread" data-disqus-identifier="cache/pages/wiki/C.html">Comments</a>


            

        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li>
<a href="C.html#sec-1">语法</a>
<ul>
<li><a href="C.html#sec-1-1">header</a></li>
<li>
<a href="C.html#sec-1-2">变量</a>
<ul>
<li><a href="C.html#sec-1-2-1">存储持续性、作用域与链接性：</a></li>
</ul>
</li>
</ul>
</li>
<li>
<a href="C.html#sec-2">IDE</a>
<ul>
<li><a href="C.html#sec-2-1">CLion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">语法</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">header</h3>
<div class="outline-text-3" id="text-1-1">
<p>
#include 如果用“”来包含文件名，则编译器先在当前的工作目录或源代码目录，用&lt;&gt;则先在存储标准头文件的文件夹中找，
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">变量</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">存储持续性、作用域与链接性：</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
1、自动存储持续性：函数或代码块中的变量（包括函数参数），进入时创建，执行完释放，（包括常规局部变量，auto声明的局部变量，使用register声明的局部变量）
</p>

<p>
2、静态存储持续性：外部定义或 static，整个程序运行过程中都存在
</p>

<p>
3、动态存储持续性：new创建，delete删除
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">IDE</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> CLion </dt>
<dd>           在Linux上开发的话强烈推荐。在使用开源工具链的场景下，CLion是第一个让我有理由
考虑代替vim的C/C++ IDE. 智能补全、Refactor、代码导航与分析、代码自动
生成、与VCS集成等功能个个顺手。实在不是什么editor+plugin所能比拟的。
这些功能以前要找N多插件还难以完美实现，现在CLion给你一个 <b>开箱即用</b>
的环境。
</dd>
</dl>
<dl class="org-dl">
<dt> vim/emacs </dt>
<dd>   用户多，除了性能和远程开发的方便程度以外，很大程度上是因为Linux上的确实没有很
好用的IDE。下面这些C/C++ IDE能提供的功能并不比vim+YouCompleteMe提
供的特性多。

<dl class="org-dl">
<dt> 编写 </dt>
<dd>        编写代码时还是vim强，可以非常快的书写，局部修改，高亮，替换基本上都是无
意识完成，这点很重要，对单线程的大脑来说要最大限度降低contextswitch。

<p>
补全感觉基于文本的补全就够了，基于文法的很省心但不觉得是必须的。 编写时
  的feature重在缩短将想法具相化成代码的延迟。
</p>
</dd>

<dt> 调试 </dt>
<dd>          调试试过一段时间的vim集成，蛋那个疼啊……

<p>
这方面还是ide强，但多数需要简单调试的地方后来基本都考日志解决了，少数
关键位置的调试还是直接进gdb写脚本方便。
</p>
</dd>

<dt> 重构 </dt>
<dd>          重构方面是vim或其他以文本编辑为目标的编辑器的共同弱点，加上c的宏的使用，
没有代码语法解析支持根本就是人肉查找替换来完成…

<p>
个人感觉这是自己唯一需要ide的情况了，也用的不多了，大部分时候倾向于通
过规范代码来简化重构的复杂性，实在不好替换是拿出ide全局改一遍就关了
</p>
</dd>
</dl>
</dd>

<dt> Visual Studio </dt>
<dd>                   是Windows下的当然选择，但是VS的C/C++补全重构功能远远比不上C#
的相关功能，而且msvc编译器长期以来支持标准的速度比较慢，使用
自有的solution格式也给维护项目增加了很多困惑。

<p>
如果你满足于使用Windows平台+msvc编译器的话，VS+VA X插件可以
提供一个很不错的环境。
</p>
</dd>
</dl>
<dl class="org-dl">
<dt> Eclipse CDT </dt>
<dd>   和Eclipse本身的缺点很类似。特性很全，但是相对来说bug比较多，比较迟缓。代码提
示和搜索功能和JetBrains的产品差一个数量级。
</dd>
<dt> Netbeans </dt>
<dd>   性能和debugger也一直有点问题。非常喜欢不断parse代码。不过支持远程开发和debug
是一个非常好的特性。
</dd>
<dt> Qt Creator 和 KDeveloper </dt>
<dd>   其实是两个相对不错的选择，但是在智能感知，项目管理、重构、quick fix这些方面始
终有些差距。
</dd>
</dl>
<p>
**
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">CLion</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="http://www.jetbrains.com/clion/">http://www.jetbrains.com/clion/</a> 跨平台，Arch Linux 下就用他
</p>

<ul class="org-ul">
<li>一键显示函数调用关系
</li>
<li>查找变量和函数的引用
</li>
<li>查找符号
</li>
<li>查找文件
</li>
<li>git 流程顺畅，review 哪里做了修改很方便
</li>
<li>非常好的智能感知功能，自动折叠、高亮、自动补全、类型推断都很好。
</li>
<li>Autofix工作的很好。
</li>
<li>重构很方便，像inline函数、extract成员函数、常数，pull up/pull down、修改签名这些功能都有。
</li>
<li>调试功能很方便，可以自动解析STL容器。
</li>
<li>继承了jetbrains系ide的很多优点，像方便的vim插件和keymap调整，滚动条预览，与VCS的紧密集成等等。
</li>
<li>跨平台，支持CMake/gcc/clang/mingw/cygwin/gdb。虽然不多，但是其实基本上也够用了。
</li>
<li>简洁，没有额外的抽象层，你直接通过控制CMakeLists/CMakeCache来控制项目的编译。这样无需额外学习一遍IDE项目相关的概念，而且省去了VS+CMake时每改一次CMakeLists就要generate一次solution的麻烦。
</li>
<li>很快，当然我也没有导入很大很大的项目，不知道结局是什么样。
</li>
</ul>
<p>
缺点
</p>
<ul class="org-ul">
<li>似乎只支持 CMake
</li>
<li>一以贯之的吃内存（随便打开个项目吃掉1G很正常）、
</li>
<li>不支持lldb（1.1版本即将支持）、
</li>
<li>不支持远程开发调试、
</li>
<li>不支持makefile/autotools项目、
</li>
<li>没有测试框架支持。
</li>
</ul>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside><section class="comments hidden-print"><h2>注释</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="qiwulun-github-io",
            disqus_url="https://qiwulun.github.io/pages/wiki/C.html",
        disqus_title="C/C++",
        disqus_identifier="cache/pages/wiki/C.html",
        disqus_config = function () {
            this.language = "zh_cn";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="qiwulun-github-io";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:qiwulun08@gmail.com">Zhao JI</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/jquery.min.js"></script><script src="../../assets/js/bootstrap.min.js"></script><script src="../../assets/js/moment-with-locales.min.js"></script><script src="../../assets/js/fancydates.js"></script><script src="../../assets/js/jquery.colorbox-min.js"></script><script src="../../assets/js/colorbox-i18n/jquery.colorbox-zh-CN.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
